WebServices1/result1/Iteration1/t1_http.xml

<?xml-stylesheet href="..\http.xsl" type="text/xsl"?>
<report vuGenInstallDir="C:\Program Files (x86)\Micro Focus\LoadRunner\">
  <http>
    <request>
      <header>POST /axis2/services/BLZService HTTP/1.1
Content-Type: text/xml; charset=utf-8; action=""
Cache-Control: no-cache
SOAPAction: ""
User-Agent: Mozilla/4.0 (compatible; MSIE 6.0; MS Web Services Client Protocol 1.1.4322.2032)
Accept-Encoding: gzip, deflate
Accept: */*
Connection: Keep-Alive
Host: www.thomas-bayer.com
Content-Length: 221

</header>
      <body>&lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&gt;
  &lt;s:Body&gt;
    &lt;getBank xmlns="http://thomas-bayer.com/blz/" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"&gt;
      &lt;blz&gt;35461106&lt;/blz&gt;
    &lt;/getBank&gt;
  &lt;/s:Body&gt;
&lt;/s:Envelope&gt;</body>
    </request>
    <response>
      <header>HTTP/1.1 200 OK
Server: Apache-Coyote/1.1
Content-Type: text/xml;charset=utf-8
Date: Mon, 13 Dec 2021 05:52:48 GMT
Content-Length: 407

</header>
      <body>&lt;?xml version="1.0" encoding="utf-8"?&gt;
&lt;soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"&gt;
  &lt;soapenv:Body&gt;
    &lt;ns1:getBankResponse xmlns:ns1="http://thomas-bayer.com/blz/"&gt;
      &lt;ns1:details&gt;
        &lt;ns1:bezeichnung&gt;Volksbank Niederrhein&lt;/ns1:bezeichnung&gt;
        &lt;ns1:bic&gt;GENODED1NRH&lt;/ns1:bic&gt;
        &lt;ns1:ort&gt;Alpen&lt;/ns1:ort&gt;
        &lt;ns1:plz&gt;46515&lt;/ns1:plz&gt;
      &lt;/ns1:details&gt;
    &lt;/ns1:getBankResponse&gt;
  &lt;/soapenv:Body&gt;
&lt;/soapenv:Envelope&gt;</body>
    </response>
  </http>
</report>